СкладГП/src/Catalogs/Склады/Склады.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Склады</name>
  <owners>Catalog.БазыПУ</owners>
  <attributes>
    <name>ВспомогательныйСклад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПредопределенногоПУ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьПриАвторизации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

СкладГП/src/CommonModules/ОбщегоНазначенияВызовСервераПовтИсп/Module.bsl
Функция Склад() Экспорт
	Возврат Константы.Склад.Получить();
КонецФункции 

Функция МассивСкладов() Экспорт
	МассивСкладов = Новый Массив;
	ОсновнойСклад = Константы.Склад.Получить();
	МассивСкладов.Добавить(ОсновнойСклад);
	Если ЗначениеЗаполнено(ОсновнойСклад.ВспомогательныйСклад) Тогда
		МассивСкладов.Добавить(ОсновнойСклад.ВспомогательныйСклад);	
	КонецЕсли;
	
	Возврат МассивСкладов;
КонецФункции

Функция МассивСкладовПУ() Экспорт
	МассивСкладов = Новый Массив;
	ОсновнойСклад = Константы.Склад.Получить();
	БазаПУ = БазаПУ();
	Если БазаПУ.ЭтоERP Тогда
		МассивСкладов.Добавить(Новый УникальныйИдентификатор(ОсновнойСклад.ИмяПредопределенногоПУ));
	Иначе
		МассивСкладов.Добавить(ОсновнойСклад.ИмяПредопределенногоПУ);
	КонецЕсли;

	Если ЗначениеЗаполнено(ОсновнойСклад.ВспомогательныйСклад) Тогда
		Если БазаПУ.ЭтоERP Тогда
			МассивСкладов.Добавить(Новый УникальныйИдентификатор(ОсновнойСклад.ВспомогательныйСклад.ИмяПредопределенногоПУ));
		Иначе
			МассивСкладов.Добавить(ОсновнойСклад.ВспомогательныйСклад.ИмяПредопределенногоПУ);
		КонецЕсли;	
	КонецЕсли;
	
	Возврат МассивСкладов;
КонецФункции

Функция ЛогинПУ() Экспорт
	Возврат Константы.ЛогинПУ.Получить();
КонецФункции

Функция БазаПУ() Экспорт
	Возврат Константы.АдресПУ.Получить();
КонецФункции

Функция ЭтоERP() Экспорт
	Возврат БазаПУ().ЭтоERP;
КонецФункции

Функция СвойстваБазыПУ() Экспорт
	База = БазаПУ();
	Ответ = Новый Структура("Адрес,https,АдресДляPing,ЭтоERP");
	ЗаполнитьЗначенияСвойств(Ответ, База);
	Возврат Новый ФиксированнаяСтруктура(Ответ);
КонецФункции

Функция УзелПУ() Экспорт
	Возврат Константы.УзелПУ.Получить();
КонецФункции

Функция ШтрихКод2D() Экспорт
	Возврат Константы.ШтрихКод2D.Получить();
КонецФункции

Функция СканированиеСтороннимПриложением() Экспорт
	Возврат Константы.СканированиеСтороннимПриложением.Получить();
КонецФункции

Функция УзелПУ_id() Экспорт
	Возврат Новый УникальныйИдентификатор(Константы.УзелПУ.Получить());
КонецФункции

Функция ПериодичностьПолученияОстатковСклада() Экспорт
	Возврат Константы.ПериодичностьПолученияОстатковСклада.Получить();
КонецФункции

Функция ПериодичностьВыгрузкиИзменений() Экспорт
	Возврат Константы.ПериодичностьВыгрузкиИзменений.Получить();
КонецФункции

Функция ДанныеУстройства() Экспорт
	Возврат ОбщегоНазначения.ДанныеУстройства();
КонецФункции

Функция ШаблонПредставленияПакета() Экспорт
	
	Шаблон = Константы.ШаблонПредставленияПакета.Получить();
	Ответ = Новый Структура("Текст, Параметры", "", Новый Массив());
	НачалоПар = 0;
	ПривШаблон  = "";
	Для инд = 1 по СтрДлина(Шаблон) Цикл
		ТекСимвол = Сред(Шаблон,инд,1);
		Если ТекСимвол = "[" Тогда
			ПривШаблон = ПривШаблон + "%"+(Ответ.Параметры.Количество()+1);
			НачалоПар = инд+1;
		ИначеЕсли ТекСимвол = "]" Тогда
			Ответ.Параметры.Добавить(Сред(Шаблон, НачалоПар, инд-НачалоПар));
			НачалоПар = 0;
		Иначе
			Если НачалоПар = 0 Тогда
				ПривШаблон = ПривШаблон + ТекСимвол;	
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Ответ.Вставить("Текст", ПривШаблон);	
	Возврат Ответ;
КонецФУнкции
	
Функция ДоступРегистрацияПоврежденийПакетов() Экспорт
	Возврат Константы.ФО_ДоступРегистрацияПоврежденийПакетов.Получить()
КонецФункции

Функция ВерсияКонфигурации() ЭКспорт
	Возврат Метаданные.Версия;
КонецФункции

Функция АдресОбновлений() ЭКспорт
	Возврат "https://hq.volwood.ru/mbgp/";
КонецФункции

Функция ОбычнийШрифт() Экспорт
	Возврат ШрифтыСтиля.ОбычныйШрифтТекста;
КонецФункции

Функция ВыводитьДатуНаФото() Экспорт
	Возврат Константы.ДобавлятьДатуВремяНаФотоЗаявкиНаПогрузку.Получить();
КонецФункции

Функция СкладПоИдентификатору(ИдСклада) Экспорт
	Выборка = Справочники.Склады.Выбрать( , БазаПУ(), Новый Структура("ИмяПредопределенногоПУ", ИдСклада));
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
КонецФункции

Функция СмещениеСтандартногоВремениУстройства() Экспорт
	Возврат СмещениеСтандартногоВремени(,);
КонецФункции

Функция ОтключитьЗаписьТрека() Экспорт
	Возврат Константы.ОтключитьЗаписьТрека.Получить()
КонецФункции
